import os
from datetime import datetime


FACEBOOK_START_DATE = datetime(2026, 5, 15)
FACEBOOK_END_DATE = datetime(2026, 5, 30)
ENABLE_FACEBOOK_POSTING = True  # 👈 toggle only

AGING_MULTIPLIER = 0.12  # configurable 0.08 - 0.15

POST_INTERVAL_MINUTES = 1

KEYWORD_PRIORITY = {
    20: ["محمد بن زايد آل نهيان"],
    19: ["محمد بن راشد آل مكتوم", "منصور بن زايد آل نهيان"],
    18: ["سلطان القاسمي", "سعود بن صقر القاسمي", "حميد بن راشد النعيمي", "حمد بن محمد الشرقي"],
    17: ["خالد بن محمد بن زايد آل نهيان", "حمدان بن محمد آل مكتوم"],
    16: ["سيف بن زايد آل نهيان", "عبدالله بن زايد آل نهيان", "طحنون بن زايد آل نهيان"],
    15: ["هزاع بن زايد آل نهيان", "حمدان بن زايد آل نهيان"],
    14: ["ذياب بن محمد بن زايد آل نهيان", "حمدان بن محمد بن زايد آل نهيان"],
    13: ["أحمد بن محمد بن راشد آل مكتوم", "منصور بن محمد بن راشد آل مكتوم"],
    12: ["عمر بن زايد آل نهيان", "نهيان بن زايد آل نهيان", "سلطان بن زايد آل نهيان", "راشد بن سعود القاسمي"],
    11: ["رئيس", "رئيس الدولة"],
    10: ["حاكم", "ولي عهد"],
    9: ["الإمارات"]
}
